## Load the Dataset

In [1]:
# Import libraries

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import re
import overpy
import time
from geopy.geocoders import Nominatim
pd.set_option('display.float_format', lambda x: '%.2f' % x)

In [2]:
# Load the dataset

df = pd.read_csv('data_kaggle.csv')
df.head()

,Location,Price,Rooms,Bathrooms,Car Parks,Property Type,Size,Furnishing
0,"KLCC, Kuala Lumpur","RM 1,250,000",2+1,3.00,2.00,Serviced Residence,"Built-up : 1,335 sq. ft.",Fully Furnished
1,"Damansara Heights, Kuala Lumpur","RM 6,800,000",6,7.00,NaN,Bungalow,Land area : 6900 sq. ft.,Partly Furnished
2,"Dutamas, Kuala Lumpur","RM 1,030,000",3,4.00,2.00,Condominium (Corner),"Built-up : 1,875 sq. ft.",Partly Furnished
3,"Cheras, Kuala Lumpur",NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,"Bukit Jalil, Kuala Lumpur","RM 900,000",4+1,3.00,2.00,Condominium (Corner),"Built-up : 1,513 sq. ft.",Partly Furnished

In [3]:
# View shape of the dataset

df.shape

(53883, 8)

In [4]:
# View basic information

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53883 entries, 0 to 53882
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Location       53883 non-null  object
 1   Price          53635 non-null  object
 2   Rooms          52177 non-null  object
 3   Bathrooms      51870 non-null  float64
 4   Car Parks      36316 non-null  float64
 5   Property Type  53858 non-null  object
 6   Size           52820 non-null  object
 7   Furnishing     46953 non-null  object
dtypes: float64(2), object(6)
memory usage: 3.3+ MB

In [5]:
# View descriptive statistics

df.describe()

       Bathrooms  Car Parks
count   51870.00   36316.00
mean        3.07       2.01
std         1.63       1.31
min         1.00       1.00
25%         2.00       1.00
50%         2.00       2.00
75%         4.00       2.00
max        20.00      30.00

## Data Pre-processing

### Handling Missing Values

In [6]:
# Find missing values

df.isnull().sum()

Location             0
Price              248
Rooms             1706
Bathrooms         2013
Car Parks        17567
Property Type       25
Size              1063
Furnishing        6930
dtype: int64

In [7]:
# Drop Car Parks since too many missing values

df.drop(['Car Parks'], axis=1, inplace=True)

In [8]:
# Impute Bathrooms with median

median = df['Bathrooms'].median()
df['Bathrooms'].fillna(median, inplace=True)

In [9]:
# Impute Rooms, Property Type and Furnishing with mode

cols = ['Rooms', 'Property Type', 'Furnishing']
for col in cols:
    mode = df[col].mode()[0]
    df[col].fillna(mode, inplace=True)

In [10]:
# Drop rows with missing Price values

df.dropna(subset=['Price'], how='all', inplace=True)

In [11]:
# Find missing values

df.isnull().sum()

Location            0
Price               0
Rooms               0
Bathrooms           0
Property Type       0
Size             1024
Furnishing          0
dtype: int64

### Formatting and Removing Outliers

### Location

In [12]:
# View value counts of Location

df['Location'].value_counts()

Mont Kiara, Kuala Lumpur                           5862
KLCC, Kuala Lumpur                                 5216
Cheras, Kuala Lumpur                               4483
Jalan Klang Lama (Old Klang Road), Kuala Lumpur    2845
Setapak, Kuala Lumpur                              2699
                                                   ...
Bukit  Persekutuan, Kuala Lumpur                      1
Wangsa Melawati, Kuala Lumpur                         1
Taman Yarl OUG, Kuala Lumpur                          1
Kota Damansara, Kuala Lumpur                          1
Kuala Lumpur, Kuala Lumpur                            1
Name: Location, Length: 111, dtype: int64

In [13]:
# Drop locations which appear 10 or less times

morethan10 = df['Location'].value_counts().loc[lambda x: x > 10].index
df = df[df['Location'].isin(atleast10)]
print(df.shape)

(53556, 7)

In [14]:
# Find number of unique locations

df['Location'].nunique()

62

### Price

In [15]:
# Remove RM from Price values

df['Price'] = df['Price'].apply(lambda x: x[2:])
df['Price']

0         1,250,000
1         6,800,000
2         1,030,000
4           900,000
5         5,350,000
            ...
53878     5,100,000
53879     5,000,000
53880     5,500,000
53881       480,000
53882       540,000
Name: Price, Length: 53556, dtype: object

In [16]:
# Import and set locale

import locale
locale.setlocale(locale.LC_ALL, 'en_CA.UTF-8')

'en_CA.UTF-8'

In [17]:
# Convert Price to numerical values

df['Price'] = df['Price'].apply(lambda x: locale.atof(x))
df['Price']

0       1250000.00
1       6800000.00
2       1030000.00
4        900000.00
5       5350000.00
           ...
53878   5100000.00
53879   5000000.00
53880   5500000.00
53881    480000.00
53882    540000.00
Name: Price, Length: 53556, dtype: float64

In [18]:
df['Price'].sort_values(ascending=True).head(10)

40037    10.00
16383   308.00
46527   330.00
19939   330.00
21941   365.00
35872   380.00
21938   390.00
20357   400.00
4719    408.00
45626   493.00
Name: Price, dtype: float64

In [19]:
df['Price'].sort_values(ascending=False).head(10)

21101   1980000000.00
12114   1600000000.00
5012    1123000000.00
34994    814572000.00
32647    415177610.00
17952    370416816.00
32648    370000000.00
29822    339768000.00
25957    262666800.00
7475     216000000.00
Name: Price, dtype: float64

In [20]:
p025 = df['Price'].quantile(0.025)
p975 = df['Price'].quantile(0.975)

print('2.5th Percentile : ' + str(p025))
print('97.5th Percentile : ' + str(p975))

2.5th Percentile : 285000.0
97.5th Percentile : 8800000.0

In [21]:
# Remove outliers

df = df[(df['Price'] > p025) & (df['Price'] < p975)]
print(df.shape)

(50860, 7)

### Rooms

In [22]:
# View value counts of Bedrooms

df['Rooms'].unique()

array(['2+1', '6', '3', '4+1', '4+2', '5', '4', '3+1', '6+1', '5+1',
       '3+2', '1', '2', '1+1', '5+2', '2+2', '7+1', 'Studio', '7', '8',
       '1+2', '6+', '8+', '8+1', '9', '10', '7+', '13+', '9+1', '11',
       '18', '10+', '20 Above', '12', '10+1', '12+', '9+', '11+1'],
      dtype=object)

In [23]:
def convert_rooms(x):
    try:
        if x.endswith('+'):
            return [x[:-1]]
        if x == '20 Above':
            return [20]
        if x == 'Studio':
            return [1]
        if x != np.NaN:
            return x.split('+')
    except AttributeError:
        return x

In [24]:
df['Rooms'] = df['Rooms'].apply(lambda x: convert_rooms(x))
df['Rooms']

0        [2, 1]
1           [6]
2           [3]
4        [4, 1]
5        [4, 2]
          ...
53878    [5, 1]
53879       [5]
53880    [5, 1]
53881       [3]
53882       [4]
Name: Rooms, Length: 50860, dtype: object

In [25]:
df['Store Rooms'] = df['Rooms'].apply(lambda x: x[1] if len(x)>1 else 0)
df['Store Rooms']

0        1
1        0
2        0
4        1
5        2
        ..
53878    1
53879    0
53880    1
53881    0
53882    0
Name: Store Rooms, Length: 50860, dtype: object

In [26]:
df['Rooms'] = df['Rooms'].apply(lambda x: x[0])
df['Rooms']

0        2
1        6
2        3
4        4
5        4
        ..
53878    5
53879    5
53880    5
53881    3
53882    4
Name: Rooms, Length: 50860, dtype: object

In [27]:
# Convert Rooms and Stroe Rooms to numerical values

df['Rooms'] = df['Rooms'].astype(int)
df['Store Rooms'] = df['Store Rooms'].astype(int)

In [28]:
# View value counts of Rooms

df['Rooms'].value_counts()

3     23161
4      9637
2      7154
5      4423
1      4245
6      1551
7       469
8       147
9        40
10       19
11        5
12        4
20        3
13        1
18        1
Name: Rooms, dtype: int64

In [29]:
# Remove outliers

df = df[df['Rooms'] <= 7]
print(df.shape)

(50640, 8)

In [30]:
df['Store Rooms'].value_counts()

0    31136
1    18173
2     1331
Name: Store Rooms, dtype: int64

### Bathrooms

In [31]:
# View value counts of Bathrooms

df['Bathrooms'].value_counts()

2.00     22172
3.00      9384
4.00      6471
5.00      4538
1.00      4104
6.00      2886
7.00       802
8.00       226
9.00        44
10.00        7
20.00        4
11.00        1
15.00        1
Name: Bathrooms, dtype: int64

In [32]:
# Remove outliers

df = df[df['Bathrooms'] <= 7]
print(df.shape)

(50357, 8)

### Property Type

In [33]:
# View value counts of Property Type

df['Property Type'].value_counts()

Condominium                               11171
Serviced Residence                         7040
Condominium (Corner)                       5607
Condominium (Intermediate)                 5001
Serviced Residence (Intermediate)          3232
                                          ...
2.5-sty Terrace/Link House (Triplex)          1
4-sty Terrace/Link House (Penthouse)          1
3-sty Terrace/Link House (Triplex)            1
2.5-sty Terrace/Link House (Penthouse)        1
4.5-sty Terrace/Link House (Corner)           1
Name: Property Type, Length: 95, dtype: int64

In [34]:
def convert_type(x):
    types = ["Terrace/Link House", "Serviced Residence", "Condominium", 
            "Semi-detached House", "Bungalow", "Apartment", "Townhouse", 
            "Flat", "Residential Land", "Cluster House"]
    for type in types:
        if re.search(type, x, flags=re.IGNORECASE) is not None:
            return type
    return x

In [35]:
df['Property Type'] = df['Property Type'].apply(lambda x: convert_type(x))

In [36]:
# View value counts of Property Type

df['Property Type'].value_counts()

Condominium            22634
Serviced Residence     13176
Terrace/Link House      7632
Bungalow                2463
Semi-detached House     2069
Apartment               1287
Townhouse                542
Residential Land         506
Flat                      40
Cluster House              8
Name: Property Type, dtype: int64

In [37]:
# Remove Cluster House since only 8 rows

df = df[df['Property Type'] != 'Cluster House']
print(df.shape)

(50349, 8)

### Size

In [38]:
# View value counts of Size

df['Size'].value_counts()

Land area : 22x75 sq. ft.    604
Built-up : 1,100 sq. ft.     533
Built-up : 950 sq. ft.       481
Land area : 22x80 sq. ft.    370
Built-up : 1,200 sq. ft.     367
                            ...
Built-up : 4,573 sq. ft.       1
Land area : 3573 sq. ft.       1
Built-up : 1,437 sq. ft.       1
Land area : 7587 sq. ft.       1
Land area : 1544 sq. ft.       1
Name: Size, Length: 5652, dtype: int64

In [39]:
def convert_size(x, index):
    try:
        return x.split(':')[index].strip()
    except AttributeError:
        return x

In [40]:
df['Size Type'] = df['Size'].apply(lambda x: convert_size(x, 0))
df['Size'] = df['Size'].apply(lambda x: convert_size(x, 1))

In [41]:
df['Size Type'].value_counts(dropna=False)

Built-up     36250
Land area    13160
NaN            939
Name: Size Type, dtype: int64

In [42]:
for index, row in df.iterrows():
    if row['Size Type'] == np.NaN:
        if row['Property Type'] in ["Terrace/Link House", 
            "Semi-detached House", "Bungalow", "Townhouse", 
            "Flat", "Residential Land"]:
            row['Size Type'] == 'Land area'
        else:
            row['Size Type'] == 'Build-up'

In [43]:
def extract_size(x):
    try:
        
        if re.search(r"sq\.*\s*ft\.*", x) is None:
            return None
    
        x = x.replace(",", "")
        x = x.replace("'", "")
        x = x.replace("sq. ft.", "")
        x = x.replace("sf", "")
        x = x.strip()
        x = x.lower()
        
        add_mult_match = re.search(r"(\d+)\s*\+\s*(\d+)\s*(?:x|\*)\s*(\d+)", x)
        if add_mult_match is not None:
            return int(add_mult_match.groups()[0]) + (
                int(add_mult_match.groups()[1]) * 
                int(add_mult_match.groups()[2]))
        
        mult_match = re.search(r"(\d+)\s*(?:x|\*)\s*(\d+)", x)
        if mult_match is not None:
            return int(mult_match.groups()[0]) * int(mult_match.groups()[1])
        
        return int(x)
    
    except:
        return None

In [44]:
df['Size'] = df['Size'].apply(lambda x: extract_size(x))

In [45]:
avg_builtup = df.groupby('Size Type')['Size'].mean()[0]
avg_landarea = df.groupby('Size Type')['Size'].mean()[1]

print(f'Average Built-up : {avg_builtup}')
print(f'Average Land Area : {avg_landarea}')

Average Built-up : 1741.1040262896277
Average Land Area : 3610.447248591495

In [46]:
n = df['Size'].isnull()
df.loc[n, 'Size'] = np.where(df.loc[n, 'Size Type'].eq('Built-up'), avg_builtup, avg_landarea)

In [47]:
b025 = df.groupby('Size Type')['Size'].quantile(q=0.025)[0]
b975 = df.groupby('Size Type')['Size'].quantile(q=0.975)[0]
l025 = df.groupby('Size Type')['Size'].quantile(q=0.025)[1]
l975 = df.groupby('Size Type')['Size'].quantile(q=0.975)[0]

In [48]:
b = df[df['Size Type'] == 'Built-up']
b = b[(b['Size'] > b025) & (b['Size'] < b975)]
l = df[df['Size Type'] == 'Land area']
l = l[(l['Size'] > l025) & (l['Size'] < l975)]

In [49]:
df = pd.concat([b, l])
print(df.shape)

(44223, 9)

In [50]:
df.drop(['Size Type'], axis=1, inplace=True)

### Furnishing

In [51]:
# View value counts of Furnishing

df['Furnishing'].value_counts()

Partly Furnished    27050
Fully Furnished     12075
Unfurnished          4675
Unknown               423
Name: Furnishing, dtype: int64

In [52]:
# Replace Unknown with Partly Furnished

df['Furnishing'].replace('Unknown', 'Partly Furnished', inplace=True)

In [53]:
# View value counts of Furnishing

df['Furnishing'].value_counts()

Partly Furnished    27473
Fully Furnished     12075
Unfurnished          4675
Name: Furnishing, dtype: int64

### Creating New Variables

In [54]:
locations = pd.DataFrame(df['Location'].unique(), columns=['Location'])

print(f'Number of Locations : {locations.shape[0]}')
print(locations.head())

Number of Locations : 62
                     Location
0          KLCC, Kuala Lumpur
1       Dutamas, Kuala Lumpur
2   Bukit Jalil, Kuala Lumpur
3  Sri Petaling, Kuala Lumpur
4    Mont Kiara, Kuala Lumpur

In [55]:
geolocator = Nominatim(user_agent="Capstone 2")

In [56]:
def create_variables(x):
    try:
        lat = geolocator.geocode(x).raw['lat']
        lon = geolocator.geocode(x).raw['lon']
        api = overpy.Overpass()
        
        query1 = """(node["amenity"="place_of_worship"](around:5000,{lat},{lon});
            
                );out;
                """.format(lat=lat,lon=lon)    
        result1 = api.query(query1)
        n_worship = len(result1.nodes)

        query2 = """(node["amenity"="school"](around:5000,{lat},{lon});

                );out;
                """.format(lat=lat,lon=lon)    
        result2 = api.query(query2)
        n_schools = len(result2.nodes)

        query3 = """(node["amenity"="hospital"](around:5000,{lat},{lon});

                );out;
                """.format(lat=lat,lon=lon)    
        result3 = api.query(query3)
        n_hospitals = len(result3.nodes)

        query4 = """(node["shop"="mall"](around:5000,{lat},{lon});

                );out;
                """.format(lat=lat,lon=lon)    
        result4 = api.query(query4)
        n_malls = len(result4.nodes)
        
        query5 = """(node["amenity"="restaurant"](around:5000,{lat},{lon});

                );out;
                """.format(lat=lat,lon=lon)    
        result5 = api.query(query5)
        n_restaurants = len(result5.nodes)
        
        return [n_worship, n_schools, n_hospitals, n_malls, n_restaurants]
    
    except:
        return [np.NaN, np.NaN, np.NaN, np.NaN, np.NaN]

In [57]:
locations['Variables'] = locations['Location'].apply(lambda x: create_variables(x))

In [58]:
locations.head()

                     Location             Variables
0          KLCC, Kuala Lumpur  [53, 24, 20, 5, 813]
1       Dutamas, Kuala Lumpur   [33, 10, 6, 1, 380]
2   Bukit Jalil, Kuala Lumpur    [19, 6, 0, 0, 196]
3  Sri Petaling, Kuala Lumpur    [19, 6, 0, 0, 228]
4    Mont Kiara, Kuala Lumpur   [32, 16, 6, 3, 439]

In [59]:
locations['Places of Worship'] = locations['Variables'].apply(lambda x: x[0])
locations['Schools'] = locations['Variables'].apply(lambda x: x[1])
locations['Hospitals'] = locations['Variables'].apply(lambda x: x[2])
locations['Malls'] = locations['Variables'].apply(lambda x: x[3])
locations['Restaurants'] = locations['Variables'].apply(lambda x: x[4])
locations.head()

,Location,Variables,Places of Worship,Schools,Hospitals,Malls,Restaurants
0,"KLCC, Kuala Lumpur","[53, 24, 20, 5, 813]",53.00,24.00,20.00,5.00,813.00
1,"Dutamas, Kuala Lumpur","[33, 10, 6, 1, 380]",33.00,10.00,6.00,1.00,380.00
2,"Bukit Jalil, Kuala Lumpur","[19, 6, 0, 0, 196]",19.00,6.00,0.00,0.00,196.00
3,"Sri Petaling, Kuala Lumpur","[19, 6, 0, 0, 228]",19.00,6.00,0.00,0.00,228.00
4,"Mont Kiara, Kuala Lumpur","[32, 16, 6, 3, 439]",32.00,16.00,6.00,3.00,439.00

In [60]:
locations.drop(['Variables'], axis=1, inplace=True)

In [61]:
locations.isnull().sum()

Location             0
Places of Worship    2
Schools              2
Hospitals            2
Malls                2
Restaurants          2
dtype: int64

In [62]:
locations.fillna(locations.median(), inplace=True)

C:\Users\Gan Kai Feng\AppData\Local\Temp\ipykernel_11772\3407720108.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  locations.fillna(locations.median(), inplace=True)

In [63]:
locations.isnull().sum()

Location             0
Places of Worship    0
Schools              0
Hospitals            0
Malls                0
Restaurants          0
dtype: int64

In [64]:
df = pd.merge(df, locations, on='Location', how='inner')
df.head()

,Location,Price,Rooms,Bathrooms,Property Type,Size,Furnishing,Store Rooms,Places of Worship,Schools,Hospitals,Malls,Restaurants
0,"KLCC, Kuala Lumpur",1250000.00,2,3.00,Serviced Residence,1335.00,Fully Furnished,1,53.00,24.00,20.00,5.00,813.00
1,"KLCC, Kuala Lumpur",2400000.00,2,2.00,Serviced Residence,1006.00,Fully Furnished,0,53.00,24.00,20.00,5.00,813.00
2,"KLCC, Kuala Lumpur",3600000.00,4,4.00,Serviced Residence,3897.00,Partly Furnished,0,53.00,24.00,20.00,5.00,813.00
3,"KLCC, Kuala Lumpur",4280000.00,3,4.00,Serviced Residence,2195.00,Fully Furnished,1,53.00,24.00,20.00,5.00,813.00
4,"KLCC, Kuala Lumpur",2300000.00,1,2.00,Serviced Residence,1023.00,Partly Furnished,0,53.00,24.00,20.00,5.00,813.00

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 44223 entries, 0 to 44222
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Location           44223 non-null  object
 1   Price              44223 non-null  float64
 2   Rooms              44223 non-null  int32
 3   Bathrooms          44223 non-null  float64
 4   Property Type      44223 non-null  object
 5   Size               44223 non-null  float64
 6   Furnishing         44223 non-null  object
 7   Store Rooms        44223 non-null  int32
 8   Places of Worship  44223 non-null  float64
 9   Schools            44223 non-null  float64
 10  Hospitals          44223 non-null  float64
 11  Malls              44223 non-null  float64
 12  Restaurants        44223 non-null  float64
dtypes: float64(8), int32(2), object(3)
memory usage: 4.4+ MB

In [66]:
# Remove the name Kuala Lumpur from values in df

df["Location"] = df["Location"].str.replace(r", Kuala Lumpur$", "")

C:\Users\Gan Kai Feng\AppData\Local\Temp\ipykernel_11772\2144498534.py:3: FutureWarning: The default value of regex will change from True to False in a future version.
  df["Location"] = df["Location"].str.replace(r", Kuala Lumpur$", "")

In [67]:
# Remove the name Kuala Lumpur from values in locations

locations["Location"] = locations["Location"].str.replace(r", Kuala Lumpur$", "")

C:\Users\Gan Kai Feng\AppData\Local\Temp\ipykernel_11772\1420928579.py:3: FutureWarning: The default value of regex will change from True to False in a future version.
  locations["Location"] = locations["Location"].str.replace(r", Kuala Lumpur$", "")

In [68]:
# Export df and locations to csv files

df.to_csv('Cleaned_Data.csv', sep=',', index=False)
locations.to_csv('Locations.csv', sep=',', index=False)